modules/gateway/gateway-management-client/src/test/resources/com/l7tech/gateway/client/testMessages/ClusterProperty_Get_Response.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:l7="http://ns.l7tech.com/2010/04/gateway-management" xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes" xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema"><env:Header><wsa:Action xmlns:ns11="http://ns.l7tech.com/2010/04/gateway-management" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa:Action><wsa:MessageID env:mustUnderstand="true">uuid:3c85ca2a-c1ea-4fe0-aea9-2cf97a5f9969</wsa:MessageID><wsa:RelatesTo>uuid:14daf359-d9ed-4025-87fe-a49e5b5c3b7e</wsa:RelatesTo><wsa:To env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To></env:Header><env:Body><l7:ClusterProperty id="20774913" version="4"><l7:Name>soap.roles</l7:Name><l7:Value>secure_span
http://www.layer7tech.com/ws/policy
http://tempuri.org/myactor4</l7:Value></l7:ClusterProperty></env:Body></env:Envelope>